rails-task-manager/app/controllers/tasks_controller.rb

  def create
    # creates a new instance of a task with user input and save the task
    @task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Running"], ["details", "Run"], ["created_at", "2021-10-02 12:54:40.655942"], ["updated_at", "2021-10-02 12:54:40.655942"]]